;[Demolition X2AbilityTemplate]
;LocFriendlyName="Area Demolition"
;LocLongDescription="Unleash a volley of bullets at target area, significantly damaging or destroying any objects and walls in it. Deals no damage to characters. Free targeting, small area of effect."
;LocHelpText="Fire at target area with high environmental damage."
;LocFlyOverText="Demolition"
;LocPromotionPopupText="<Bullet/> Demolition requires <Ability:SelfAmmoCost/> ammo points and has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Demolition does increased environmental damage, and will destroy most cover objects.<br/>"
;LocMissMessage="Missed!"

[SniperStandardFire X2AbilityTemplate]
LocFriendlyName="Fire Weapon"
LocHelpText="Fire a shot at a target. Requires two actions."
LocLongDescription="Heavier primary weapons require two actions to fire."

[SniperRifleOverwatch X2AbilityTemplate]
LocFriendlyName="Overwatch"
LocHelpText="Fire on the first enemy that moves within your line of sight, with a penalty to aim. Requires two actions."
LocLongDescriptionWhenConcealed="Heavier primary weapons require two actions to fire."

[SingleReload X2AbilityTemplate]
LocFriendlyName="Single Reload"
LocHelpText="Reload a single round into your weapon."
LocFlyOverText="Reloading"

[FullReload X2AbilityTemplate]
LocFriendlyName="Full Reload"
LocHelpText="Completely reload your weapon. Takes two actions."
LocFlyOverText="Reloading"

[FullReloadCannon X2AbilityTemplate]
LocFriendlyName="Reload"
LocHelpText="Reload your weapon. Takes two actions."
LocFlyOverText="Reloading"

[ABBSpray X2AbilityTemplate]
LocFriendlyName="Spray"
LocHelpText="Fire a shot at a target with low accuracy. Doesn't end the turn. Can not headshot."
LocLongDescription="Fire a shot at -20 aim. Doesn't end the turn. Does not count as a headshot on the Lost, and does not count as a standard shot for abilities such as Hit and Run."

[ABBNonCannonSpray X2AbilityTemplate]
LocFriendlyName="Spray"
LocHelpText="Fire a shot at a target with low accuracy. Doesn't end the turn. Can not headshot."
LocLongDescription="Fire a shot at -20 aim. Doesn't end the turn. Does not count as a headshot on the Lost, and does not count as a standard shot for abilities such as Hit and Run."

[ABBTriggerHappy X2AbilityTemplate]
LocFriendlyName="Trigger Happy"
FriendlyName="Trigger Happy"
LocFlyOverText="Trigger Happy"
LocLongDescription="Allows the use of Spray with all primary firearms. With firearms that have Spray already, reduces Spray's aim penalty from -20 to -15."
LocHelpText="Allows the use of Spray with all primary firearms. With firearms that have Spray already, reduces Spray's aim penalty from -20 to -15."
LocPromotionPopupText="<Bullet/> Spray usually allows a primary firearm to shoot for one action and without ending the turn, but at a -20 aim penalty. <br/><Bullet/> Trigger Happy reduces this aim penalty to -15 for primary firearms that have Spray already and allows the use of Spray on all other primary firearms."

[ABBTriggerHappyBonus X2AbilityTemplate]
LocFriendlyName="Trigger Happy"
FriendlyName="Trigger Happy"
LocFlyOverText="Trigger Happy"
LocLongDescription="Allows the use of Spray with all primary firearms. With firearms that have Spray already, reduces Spray's aim penalty from -20 to -15."
LocHelpText="Allows the use of Spray with all primary firearms. With firearms that have Spray already, reduces Spray's aim penalty from -20 to -15."
LocPromotionPopupText="<Bullet/> Spray usually allows a primary firearm to shoot for one action and without ending the turn, but at a -20 aim penalty. <br/><Bullet/> Trigger Happy reduces this aim penalty to -15 for primary firearms that have Spray already and allows the use of Spray on all other primary firearms. <br/><Bullet/>If you use this perk with shotguns or assault rifles, you can use Spray with your first action, then take a regular shot with the second action."

[StrafingShot X2AbilityTemplate]
LocFriendlyName="Strafing Shot"
LocLongDescription="Fire your weapon, then gain a single bonus move, but the soldier's movement speed will be halved for the remainder of this turn. Requires 1 action and ends the turn after the soldier takes their half move."
LocHelpText="Fire your weapon, then gain a single bonus move. Your movement speed is halved for the rest of this turn after using this ability."

[ABBPhoenixManeuver X2AbilityTemplate]
LocFriendlyName="Phoenix Maneuver"
LocLongDescription="Fire your weapon, then gain a single bonus move at half your movement speed. Requires 2 actions and can be used once per turn."
LocHelpText="Fire your weapon, then gain a single bonus move at half your movement speed. Requires 2 actions."

[ABBReadyForAnything X2AbilityTemplate]
LocFriendlyName="Smart Overwatch"
LocFlyOverText="Overwatch: Smartgun"
LocHelpText="Enter Overwatch after firing a standard shot with your primary weapon. Requires 2 actions."
LocLongDescription="Enter Overwatch after firing a standard shot with your primary weapon. Requires 2 actions."

[ABBBreach X2AbilityTemplate]
LocFriendlyName="Breaching Round"
LocHelpText="Fire at an enemy. Should you miss, you rip apart the target's cover. Uses 4 ammo."
LocLongDescription="Fire at an enemy, using 4 ammo. Should you miss, you destroy the target's cover instead. The shot has a -20 aim penalty, and grazes will becomes misses instead. Can be used once per turn."

[ABBSnapShot X2AbilityTemplate]
LocFriendlyName="Snap Shot"
LocFlyOverText="Snap Shot"
LocLongDescription="You may take standard shots and enter standard Overwatch with your Scout Rifle after moving, but you suffer range penalties starting at 22 tiles that get worse the further away you are from the target."
LocHelpText="Shoot the target."

[ABBSnapShotOverwatch X2AbilityTemplate]
LocFriendlyName="Overwatch (Snap Shot)"
LocHelpText="Fire on the first enemy that moves within your line of sight, with a penalty to to aim. The solder will not take an Overwatch shot without at least a 1% chance to hit."
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight, but only if revealed."
LocFlyOverText="Overwatch"
LocFriendlyNameWhenConcealed="Overwatch (Snap Shot, Concealed)"

[ABBCannonCloseCombatSpecialist X2AbilityTemplate]
LocFriendlyName="Reactive Fire"
LocFlyOverText="Reactive Fire"
LocHelpText="Confers a reaction shot against any enemy who closes to within 5 tiles. Does not require Overwatch and can trigger multiple times per enemy."
LocLongDescription="Confers a reaction shot against any enemy who closes to within 5 tiles. Does not require Overwatch and can trigger multiple times per enemy."

[ABBPistolCloseCombatSpecialist X2AbilityTemplate]
LocFriendlyName="Reflex Shot"
LocFlyOverText="Reflex Shot"
LocHelpText="Once per turn, fire a reaction shot with your semi-auto pistol at any enemy who closes to within 7 tiles. Does not require Overwatch."
LocLongDescription="Once per turn, fire a reaction shot with your semi-auto pistol at any enemy who closes to within 7 tiles. Does not require Overwatch."

[ABBDuplexFire X2AbilityTemplate]
LocFriendlyName="Duplex Fire"
LocFlyOverText="Duplex Fire"
LocHelpText="Fire your semi-auto pistol twice at a target, with a -15 aim penalty for both shots."
LocLongDescription="Fire your semi-auto pistol twice at a target, with a -15 aim penalty for both shots. Ends the soldier's turn when used and can be used once per turn."

[ABBAcidBlobCV X2AbilityTemplate]
LocFriendlyName="Launch Acid Blob"
LocLongDescription="Launch a blob of acid at an area, which deals damage, shreds armor, ruptures targets and leaves a pool of acid, but deals no damage to terrain. The launcher's acid reserves are limited, and it must cool down between shots."
LocHelpText="Launch a blob of acid at an area, which deals damage, shreds armor, ruptures targets and leaves a pool of acid, but deals no damage to terrain. The launcher's acid reserves are limited, and it must cool down between shots."

[ABBAcidBlobMG X2AbilityTemplate]
LocFriendlyName="Launch Acid Blob"
LocLongDescription="Launch a blob of acid at an area, which deals damage, shreds armor, ruptures targets and leaves a pool of acid, but deals no damage to terrain. The launcher's acid reserves are limited, and it must cool down between shots."
LocHelpText="Launch a blob of acid at an area, which deals damage, shreds armor, ruptures targets and leaves a pool of acid, but deals no damage to terrain. The launcher's acid reserves are limited, and it must cool down between shots."

[ABBAcidBlobBM X2AbilityTemplate]
LocFriendlyName="Launch Acid Blob"
LocLongDescription="Launch a blob of acid at an area, which deals damage, shreds armor, ruptures targets and leaves a pool of acid, but deals no damage to terrain. The launcher's acid reserves are limited, and it must cool down between shots."
LocHelpText="Launch a blob of acid at an area, which deals damage, shreds armor, ruptures targets and leaves a pool of acid, but deals no damage to terrain. The launcher's acid reserves are limited, and it must cool down between shots."

[ABBPinDown X2AbilityTemplate]
LocFriendlyName="Pin Down"
LocFlyOverText="Pin Down"
LocHelpText="Firing a standard shot at a target imposes a -10 aim penalty, a -20 crit chance penalty, and a -4 mobility penalty to that target until the beginning of your next turn, even if the shot misses."
LocLongDescription="Firing a standard shot at a target imposes a -10 aim penalty, a -20 crit chance penalty, and a -4 mobility penalty to that target until the beginning of your next turn, even if the shot misses."
LocPromotionPopupText="<Bullet/> Only applies to directed standard shots and similar abilities such as Snap Shot or Light Em Up. Does not apply to Overwatch or other reaction shots, nor most special shots such as Deadeye. Only works with primary weapons, not secondaries or pistols."

[ABBTakeDown X2AbilityTemplate]
LocFriendlyName="Take Down"
LocFlyOverText="Take Down"
LocHelpText="A finishing move using the stock of your gun that never misses and does not end your turn even when used with a dash move, but can only target damaged enemies on 3 or less HP."
LocLongDescription="A finishing move using the stock of your gun that never misses and does not end your turn even when used with a dash move, but can only target damaged enemies on 3 or less HP."
LocPromotionPopupText="<Bullet/> This attack always deals 5 damage. If the enemy has enough armor or other damage resistance, Take Down may not always result in a kill. Take Down can be used once per turn, and can be used with a dash only if used as the first action."

[ABBBodyHarvest X2AbilityTemplate]
LocFriendlyName="Body Harvest"
LocFlyOverText="Body Harvest"
LocHelpText="A finishing move using your melee weapon that never misses and is a free action even when used with a dash move, but can only target damaged enemies on 3 or less HP. Has a 5-turn cooldown."
LocLongDescription="A finishing move using your melee weapon that never misses and is a free action even when used with a dash move, but can only target damaged enemies on 3 or less HP. Has a 5-turn cooldown."
LocPromotionPopupText="<Bullet/> This attack deals damage equal to your weapon damage. If the enemy has enough armor or other damage resistance, Body Harvest may not always result in a kill."

[ABBSureShot X2AbilityTemplate]
LocFriendlyName="Sure Shot"
LocFlyOverText="Sure Shot"
LocHelpText="Each turn, the first standard pistol shot made within 4 tiles of the target refunds one action point after use."
LocLongDescription="Each turn, the first standard pistol shot made within 4 tiles of the target refunds one action point after use."
LocPromotionPopupText="This ability applies only to standard shots fired by the Persuader, not your primary weapon or any other weapons."

[AutoSniperSteadyWeapon X2AbilityTemplate]
LocFriendlyName="Steady Weapon"
LocFlyOverText="Steady Weapon"
LocLongDescription="Steady your primary weapon in order to have a chance at landing your shots in spite of its wild recoil. Grants +120 aim to your next shot with your primary weapon. Costs two actions. Bonus is lost after you shoot, take another action such as moving, or take damage."
LocHelpText="Steady your primary weapon for two actions to fire accurately with your next shot."

[ABBActivatePsiInducer X2AbilityTemplate]
LocFriendlyName="Activate Psi Inducer"
LocFlyOverText="Activate Psi Inducer"
LocLongDescription="Reset all of your ability cooldowns to zero. By default, each use of this ability takes 1 action, does not end the turn and costs 3 charges. Can be used once per turn. You start with 3 charges, and gain 1 charge for each enemy you kill."
LocHelpText="Reset all of your ability cooldowns to zero for one action. Does not end the turn, costs 3 charges and can be used once per turn."
LocPromotionPopupText="<Bullet/> Reset all of your ability cooldowns to zero.  By default, each use of this ability takes 1 action, does not end the turn and costs 3 charges. Can be used once per turn. <br/> <Bullet/> You start with 3 charges, and gain 1 charge for each enemy you kill. Kills do not need to be made by this weapon, but they do need to be made by the soldier wielding it.<br/>"

[ABBMutilate X2AbilityTemplate]
LocFriendlyName="Mutilate"
LocFlyOverText="Mutilate"
LocLongDescription="A ruthless slash attack that, if it hits, is guaranteed to be a critical hit on most enemies and deals 1 point of Rupture. Has a 5-turn cooldown, requires at least one action and ends the soldier's turn when used."
LocHelpText="A ruthless slash attack that, if it hits, is guaranteed to be a critical hit on most enemies and deals 1 point of Rupture."
LocPromotionPopupText="<Bullet/> Mutilate's critical hit chance bonus is +200%, meaning it will hit critically against any enemy other than ones that can't be critically hit at all. <br/> <Bullet/> This has the side effect of making all but the highest enemy dodge values useless, which even allows the attacker to break a Muton's guard and negate its counterattack. <br/> <Bullet/> Although the crit is all but guaranteed, Mutilate can still miss."

[EasyHandling X2AbilityTemplate]
LocFriendlyName="Easy Handling"
LocFlyOverText="Easy Handling"
LocLongDescription="All grazes with this weapon are automatically upgraded to normal hits."
LocHelpText="All grazes with this weapon are automatically upgraded to normal hits."
LocPromotionPopupText="<Bullet/> If a weapon with this ability is being wielded by a dual pistol user, the ability will only affect attacks by that specific weapon. Both weapons need to have this ability in order for it to apply to all of their dual wielding attacks."

[ABBTriggerHappyPCS X2EquipmentTemplate]
FriendlyName="PCS: Trigger Happy"
FriendlyNamePlural="PCS: Trigger Happy"
BriefSummary="Grants the Spray ability: a shot with your primary firearm that costs only 1 action and doesn't end the turn, regardless of the weapon type, but has a -20 penalty to aim. If your primary firearm already includes Spray, Trigger Happy reduces Spray's aim penalty from -20 to -15."

[T1AdventWeaponLootCrate X2ItemTemplate]
FriendlyName = "Advent Weapon Crate (standard)"
FriendlyNamePlural = "Advent Weapon Crates (standard)"
BriefSummary = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."
TacticalText = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."

[T1EAdventWeaponLootCrate X2ItemTemplate]
FriendlyName = "Advent Weapon Crate (exotic)"
FriendlyNamePlural = "Advent Weapon Crates (exotic)"
BriefSummary = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."
TacticalText = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."

[T2AdventWeaponLootCrate X2ItemTemplate]
FriendlyName = "Enhanced Advent Weapon Crate (standard)"
FriendlyNamePlural = "Enhanced Advent Weapon Crates (standard)"
BriefSummary = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."
TacticalText = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."

[T2EAdventWeaponLootCrate X2ItemTemplate]
FriendlyName = "Enhanced Advent Weapon Crate (exotic)"
FriendlyNamePlural = "Enhanced Advent Weapon Crates (exotic)"
BriefSummary = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."
TacticalText = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."

[T3AdventWeaponLootCrate X2ItemTemplate]
FriendlyName = "Master-Crafted Advent Weapon Crate (standard)"
FriendlyNamePlural = "Master-Crafted Advent Weapon Crates (standard)"
BriefSummary = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."
TacticalText = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."

[T3EAdventWeaponLootCrate X2ItemTemplate]
FriendlyName = "Master-Crafted Advent Weapon Crate (exotic)"
FriendlyNamePlural = "Master-Crafted Advent Weapon Crates (exotic)"
BriefSummary = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."
TacticalText = "A crate with sophisticated security features, which no doubt contains something valuable. With a proper place to work on it, some time, and enough scientists and engineers, and some resources to counterfeit a key, I believe we can safely open the crate without triggering any of its failsafes. According to the Black Market vendor, these don't have value to anyone but collectors due to their difficulty in opening and don't sell for much."

[UnlockT1AdventLootCrate X2TechTemplate]
DisplayName="Unlock Advent Weapon Crate (standard)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. We'll also need a small amount of resources to counterfeit a key. Each crate has a unique lock, so the key will only be good for a single use."

[UnlockT1EAdventLootCrate X2TechTemplate]
DisplayName="Unlock Advent Weapon Crate (exotic)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. We'll also need a small amount of resources to counterfeit a key. Each crate has a unique lock, so the key will only be good for a single use."

[UnlockT2AdventLootCrate X2TechTemplate]
DisplayName="Unlock Enhanced Advent Weapon Crate (standard)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. We'll also need a small amount of resources to counterfeit a key. Each crate has a unique lock, so the key will only be good for a single use."

[UnlockT2EAdventLootCrate X2TechTemplate]
DisplayName="Unlock Enhanced Advent Weapon Crate (exotic)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. We'll also need a small amount of resources to counterfeit a key. Each crate has a unique lock, so the key will only be good for a single use."

[UnlockT3AdventLootCrate X2TechTemplate]
DisplayName="Unlock Master-Crafted Advent Weapon Crate (standard)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. We'll also need a small amount of resources to counterfeit a key. Each crate has a unique lock, so the key will only be good for a single use."

[UnlockT3EAdventLootCrate X2TechTemplate]
DisplayName="Unlock Master-Crafted Advent Weapon Crate (exotic)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. We'll also need a small amount of resources to counterfeit a key. Each crate has a unique lock, so the key will only be good for a single use."

[UnlockT1AdventLootCrateFree X2TechTemplate]
DisplayName="Unlock Advent Weapon Crate (standard, free)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. Thanks to the growth of our Science and Engineering teams, they have been able to come up with a method of safely disengaging the lock without the need of a counterfeit key."

[UnlockT1EAdventLootCrateFree X2TechTemplate]
DisplayName="Unlock Advent Weapon Crate (exotic, free)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. Thanks to the growth of our Science and Engineering teams, they have been able to come up with a method of safely disengaging the lock without the need of a counterfeit key."

[UnlockT2AdventLootCrateFree X2TechTemplate]
DisplayName="Unlock Enhanced Advent Weapon Crate (standard, free)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. Thanks to the growth of our Science and Engineering teams, they have been able to come up with a method of safely disengaging the lock without the need of a counterfeit key."

[UnlockT2EAdventLootCrateFree X2TechTemplate]
DisplayName="Unlock Enhanced Advent Weapon Crate (exotic, free)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. Thanks to the growth of our Science and Engineering teams, they have been able to come up with a method of safely disengaging the lock without the need of a counterfeit key."

[UnlockT3AdventLootCrateFree X2TechTemplate]
DisplayName="Unlock Master-Crafted Advent Weapon Crate (standard, free)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. Thanks to the growth of our Science and Engineering teams, they have been able to come up with a method of safely disengaging the lock without the need of a counterfeit key."

[UnlockT3EAdventLootCrateFree X2TechTemplate]
DisplayName="Unlock Master-Crafted Advent Weapon Crate (exotic, free)"
Summary="This crate has sophisticated security features, which could do anything from destroying the contents to destroying an entire room, or worse, if we don't take the time and have the right people to open it safely. For this reason, opening it by force is completely out of the question. Thanks to the growth of our Science and Engineering teams, they have been able to come up with a method of safely disengaging the lock without the need of a counterfeit key."

[ABBA_ADVENT_SMG_CV X2WeaponTemplate]
FriendlyName="Advent SMG"
FriendlyNamePlural="Advent SMGs"
BriefSummary="The Advent SMG is a light weapon, allowing the user to make use of a Strafing Shot ability that grants a half-movement action following a shot. Critical hit chance and critical hit damage are both high."
TacticalText="<Bullet/> This weapon is as accurate as a shotgun up close, and as accurate as a standard SMG at range.\n<Bullet/> The Advent SMG is best used for hit and run attacks in close quarters. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="SMG"

[ABBA_ADVENT_SMG_MG X2WeaponTemplate]
FriendlyName="Enhanced Advent SMG"
FriendlyNamePlural="Enhanced Advent SMGs"
BriefSummary="The Advent SMG is a light weapon, allowing the user to make use of a Strafing Shot ability that grants a half-movement action following a shot. Critical hit chance and critical hit damage are both high."
TacticalText="<Bullet/> This weapon is as accurate as a shotgun up close, and as accurate as a standard SMG at range.\n<Bullet/> The Advent SMG is best used for hit and run attacks in close quarters. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="SMG"

[ABBA_ADVENT_SMG_BM X2WeaponTemplate]
FriendlyName="Master-crafted Advent SMG"
FriendlyNamePlural="Master-crafted Advent SMGs"
BriefSummary="The Advent SMG is a light weapon, allowing the user to make use of a Strafing Shot ability that grants a half-movement action following a shot. Critical hit chance and critical hit damage are both high."
TacticalText="<Bullet/> This weapon is as accurate as a shotgun up close, and as accurate as a standard SMG at range.\n<Bullet/> The Advent SMG is best used for hit and run attacks in close quarters. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="SMG"

[ABBA_ADVENT_ASSAULTRIFLE_CV X2WeaponTemplate]
FriendlyName="Advent Enforcer Rifle"
FriendlyNamePlural="Advent Enforcer Rifles"
BriefSummary="The Advent Enforcer Rifle is a cutting edge pacification weapon, the next step following Advent's successful Project Miranda experiments and an alternative to our Skirmishers' bullpups. It can fire a special shot that stuns any target, including mechanical ones."
TacticalText="<Bullet/> This rifle's accuracy does not change much regardless of the distance from the target. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="enforcer rifle"

[ABBA_ADVENT_ASSAULTRIFLE_MG X2WeaponTemplate]
FriendlyName="Enhanced Advent Enforcer Rifle"
FriendlyNamePlural="Enhanced Advent Enforcer Rifles"
BriefSummary="The Advent Enforcer Rifle is a cutting edge pacification weapon, the next step following Advent's successful Project Miranda experiments and an alternative to our Skirmishers' bullpups. It can fire a special shot that stuns any target, including mechanical ones."
TacticalText="<Bullet/> This rifle's accuracy does not change much regardless of the distance from the target. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="enforcer rifle"

[ABBA_ADVENT_ASSAULTRIFLE_BM X2WeaponTemplate]
FriendlyName="Master-crafted Advent Enforcer Rifle"
FriendlyNamePlural="Master-crafted Advent Enforcer Rifles"
BriefSummary="The Advent Enforcer Rifle is a cutting edge pacification weapon, the next step following Advent's successful Project Miranda experiments and an alternative to our Skirmishers' bullpups. It can fire a special shot that stuns any target, including mechanical ones."
TacticalText="<Bullet/> This rifle's accuracy does not change much regardless of the distance from the target. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="enforcer rifle"

[ABBA_ADVENT_CARBINE_CV X2WeaponTemplate]
FriendlyName="Advent Inducer Carbine"
FriendlyNamePlural="Advent Inducer Carbines"
BriefSummary="A variant of the Advent Priest's rifle and serving as an alternative to our soldiers' Assault Rifles, the Advent Inducer Carbine's primary function is that of a catalyst rather than a weapon. It only offers SMG-level firepower, but it also features an internal biological Psionic component, similar to a miniaturized Gatekeeper, that can manipulate the wielder's mind, body, and gear alike, resetting ability cooldowns. Try not to think about the ethical complications of this one."
TacticalText="<Bullet/> The Advent Inducer Carbine is about as accurate as a standard Assault Rifle. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="inducer carbine"

[ABBA_ADVENT_CARBINE_MG X2WeaponTemplate]
FriendlyName="Enhanced Advent Inducer Carbine"
FriendlyNamePlural="Enhanced Advent Inducer Carbines"
BriefSummary="A variant of the Advent Priest's rifle and serving as an alternative to our soldiers' Assault Rifles, the Advent Inducer Carbine's primary function is that of a catalyst rather than a weapon. It only offers SMG-level firepower, but it also features an internal biological Psionic component, similar to a miniaturized Gatekeeper, that can manipulate the wielder's mind, body, and gear alike, resetting ability cooldowns. Try not to think about the ethical complications of this one."
TacticalText="<Bullet/> The Advent Inducer Carbine is about as accurate as a standard Assault Rifle. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="inducer carbine"

[ABBA_ADVENT_CARBINE_BM X2WeaponTemplate]
FriendlyName="Master-crafted Advent Inducer Carbine"
FriendlyNamePlural="Master-crafted Advent Inducer Carbines"
BriefSummary="A variant of the Advent Priest's rifle and serving as an alternative to our soldiers' Assault Rifles, the Advent Inducer Carbine's primary function is that of a catalyst rather than a weapon. It only offers SMG-level firepower, but it also features an internal biological Psionic component, similar to a miniaturized Gatekeeper, that can manipulate the wielder's mind, body, and gear alike, resetting ability cooldowns. Try not to think about the ethical complications of this one."
TacticalText="<Bullet/> The Advent Inducer Carbine is about as accurate as a standard Assault Rifle. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="inducer carbine"

[ABBA_ADVENT_SHOTGUN_CV X2WeaponTemplate]
FriendlyName="Advent Shotgun"
FriendlyNamePlural="Advent Shotguns"
BriefSummary="The Advent Shotgun is easy to handle and yet cumbersome to reload. The user will be able to hunker down automatically if they don't attack. Although its ability to hit critically is lower than a typical shotgun, the Advent Shotgun can fire breaching rounds that easily destroy any cover they hit."
TacticalText="<Bullet/> This shotgun has two options for reloading: Single Reload, which loads one round for one action and does not end the turn, and Full Reload, which loads an entire magazine for two actions. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="shotgun"

[ABBA_ADVENT_SHOTGUN_MG X2WeaponTemplate]
FriendlyName="Enhanced Advent Shotgun"
FriendlyNamePlural="Enhanced Advent Shotguns"
BriefSummary="The Advent Shotgun is easy to handle and yet cumbersome to reload. The user will be able to hunker down automatically if they don't attack. Although its ability to hit critically is lower than a typical shotgun, the Advent Shotgun can fire breaching rounds that easily destroy any cover they hit."
TacticalText="<Bullet/> This shotgun has two options for reloading: Single Reload, which loads one round for one action and does not end the turn, and Full Reload, which loads an entire magazine for two actions. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="shotgun"

[ABBA_ADVENT_SHOTGUN_BM X2WeaponTemplate]
FriendlyName="Master-crafted Advent Shotgun"
FriendlyNamePlural="Master-crafted Advent Shotguns"
BriefSummary="The Advent Shotgun is easy to handle and yet cumbersome to reload. The user will be able to hunker down automatically if they don't attack. Although its ability to hit critically is lower than a typical shotgun, the Advent Shotgun can fire breaching rounds that easily destroy any cover they hit."
TacticalText="<Bullet/> This shotgun has two options for reloading: Single Reload, which loads one round for one action and does not end the turn, and Full Reload, which loads an entire magazine for two actions. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="shotgun"

[ABBA_ADVENT_SCOUTRIFLE_CV X2WeaponTemplate]
FriendlyName="Advent Scout Rifle"
FriendlyNamePlural="Advent Scout Rifles"
BriefSummary="The Advent Scout Rifle is designed for use by reconnaissance units. It doesn't hit as hard as a sniper rifle, but it can be fired even after moving. It can also be fired without moving and then followed up with a half-move, but only once per turn."
TacticalText="<Bullet/> Compared to a regular sniper rifle, this rifle is a little more accurate up close, but a little less accurate at range. \n<Bullet/> The Advent Scout Rifle is a good choice for spotters, gunslingers or officers who need to keep up with the squad. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="scout rifle"

[ABBA_ADVENT_SCOUTRIFLE_MG X2WeaponTemplate]
FriendlyName="Enhanced Advent Scout Rifle"
FriendlyNamePlural="Enhanced Advent Scout Rifles"
BriefSummary="The Advent Scout Rifle is designed for use by reconnaissance units. It doesn't hit as hard as a sniper rifle, but it can be fired even after moving. It can also be fired without moving and then followed up with a half-move, but only once per turn."
TacticalText="<Bullet/> Compared to a regular sniper rifle, this rifle is a little more accurate up close, but a little less accurate at range. \n<Bullet/> The Advent Scout Rifle is a good choice for spotters, gunslingers or officers who need to keep up with the squad. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="scout rifle"

[ABBA_ADVENT_SCOUTRIFLE_BM X2WeaponTemplate]
FriendlyName="Master-crafted Advent Scout Rifle"
FriendlyNamePlural="Master-crafted Advent Scout Rifles"
BriefSummary="The Advent Scout Rifle is designed for use by reconnaissance units. It doesn't hit as hard as a sniper rifle, but it can be fired even after moving. It can also be fired without moving and then followed up with a half-move, but only once per turn."
TacticalText="<Bullet/> Compared to a regular sniper rifle, this rifle is a little more accurate up close, but a little less accurate at range. \n<Bullet/> The Advent Scout Rifle is a good choice for spotters, gunslingers or officers who need to keep up with the squad. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="scout rifle"

[ABBA_ADVENT_BREAKERRIFLE_CV X2WeaponTemplate]
FriendlyName="Advent Breaker Rifle"
FriendlyNamePlural="Advent Breaker Rifles"
BriefSummary="The Advent Breaker Rifle is a powerful alternative to the Reapers' Vektor Rifle series, which is as accurate from range, but much less so up close. It is designed to fire its entire magazine in a single burst, which means it must be reloaded after every shot. This Advent take on an auto-sniper rifle fires smaller caliber shots and has an integrated compensator, making it just as easy to land shots with overall as a standard Vektor Rifle."
TacticalText="<Bullet/> This weapon cannot equip Auto Loaders or Extended Magazines. \n<Bullet/> The Advent Breaker Rifle is a good choice for decisive killshots as long as the soldier doesn't rely on multi-shot abilities like Banish. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="breaker rifle"

[ABBA_ADVENT_BREAKERRIFLE_MG X2WeaponTemplate]
FriendlyName="Enhanced Advent Breaker Rifle"
FriendlyNamePlural="Enhanced Advent Breaker Rifles"
BriefSummary="The Advent Breaker Rifle is a powerful alternative to the Reapers' Vektor Rifle series, which is as accurate from range, but much less so up close. It is designed to fire its entire magazine in a single burst, which means it must be reloaded after every shot. This Advent take on an auto-sniper rifle fires smaller caliber shots and has an integrated compensator, making it just as easy to land shots with overall as a standard Vektor Rifle."
TacticalText="<Bullet/> This weapon cannot equip Auto Loaders or Extended Magazines. \n<Bullet/> The Advent Breaker Rifle is a good choice for decisive killshots as long as the soldier doesn't rely on multi-shot abilities like Banish. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="breaker rifle"

[ABBA_ADVENT_BREAKERRIFLE_BM X2WeaponTemplate]
FriendlyName="Master-crafted Advent Breaker Rifle"
FriendlyNamePlural="Master-crafted Advent Breaker Rifles"
BriefSummary="The Advent Breaker Rifle is a powerful alternative to the Reapers' Vektor Rifle series, which is as accurate from range, but much less so up close. It is designed to fire its entire magazine in a single burst, which means it must be reloaded after every shot. This Advent take on an auto-sniper rifle fires smaller caliber shots and has an integrated compensator, making it just as easy to land shots with overall as a standard Vektor Rifle."
TacticalText="<Bullet/> This weapon cannot equip Auto Loaders or Extended Magazines. \n<Bullet/> The Advent Breaker Rifle is a good choice for decisive killshots as long as the soldier doesn't rely on multi-shot abilities like Banish. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="breaker rifle"

[ABBA_ADVENT_CANNON_CV X2WeaponTemplate]
FriendlyName="Advent Smartgun"
FriendlyNamePlural="Advent Smartguns"
BriefSummary="A compact cannon with electronics that allow for automatic tracking of targets. Its effective range is similar to a standard cannon or LMG while damage is slightly lower. Whenever the soldier takes a standard shot, the weapon will enter Overwatch mode. Advent Smartguns also fire automatically against hostiles in close range. Comes with a massive magazine, but reloading costs two actions."
TacticalText="<Bullet/> Requires two actions to fire, but also enters Overwatch after firing. Regular Overwatch still costs just one action. \n<Bullet/> The Advent Smartgun is a good choice for dealing with swarms of enemies that rush in close, like the Lost or Chryssalids. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="smartgun"

[ABBA_ADVENT_CANNON_MG X2WeaponTemplate]
FriendlyName="Enhanced Advent Smartgun"
FriendlyNamePlural="Enhanced Advent Smartguns"
BriefSummary="A compact cannon with electronics that allow for automatic tracking of targets. Its effective range is similar to a standard cannon or LMG while damage is slightly lower. Whenever the soldier takes a standard shot, the weapon will enter Overwatch mode. Advent Smartguns also fire automatically against hostiles in close range. Comes with a massive magazine, but reloading costs two actions."
TacticalText="<Bullet/> Requires two actions to fire, but also enters Overwatch after firing. Regular Overwatch still costs just one action. \n<Bullet/> The Advent Smartgun is a good choice for dealing with swarms of enemies that rush in close, like the Lost or Chryssalids. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="smartgun"

[ABBA_ADVENT_CANNON_BM X2WeaponTemplate]
FriendlyName="Master-crafted Advent Smartgun"
FriendlyNamePlural="Master-crafted Advent Smartguns"
BriefSummary="A compact cannon with electronics that allow for automatic tracking of targets. Its effective range is similar to a standard cannon or LMG while damage is slightly lower. Whenever the soldier takes a standard shot, the weapon will enter Overwatch mode. Advent Smartguns also fire automatically against hostiles in close range. Comes with a massive magazine, but reloading costs two actions."
TacticalText="<Bullet/> Requires two actions to fire, but also enters Overwatch after firing. Regular Overwatch still costs just one action. \n<Bullet/> The Advent Smartgun is a good choice for dealing with swarms of enemies that rush in close, like the Lost or Chryssalids. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="smartgun"

[ABBA_ADVENT_GRENADELAUNCHER_CV X2WeaponTemplate]
FriendlyName="Advent Acid Launcher"
FriendlyNamePlural="Advent Acid Launchers"
BriefSummary="A madman's creation; the Advent Acid Launcher fires the same sorts of acid blobs that the Andromedon does. Unlike with an Andromedon's acid weapon system, this launcher cannot produce acid indefinitely and is limited to 2 charges per mission. Although it resembles a standard grenade launcher on the outside, its internals were designed for its own acid blob rounds only and cannot fire grenades. The launcher must cool down between shots."
TacticalText="<Bullet/> Cannot launch grenades, and thus provides no range or radius bonus to them. \n<Bullet/> The Advent Acid Launcher deals pure acid damage, and as such will not destroy loot, is not resisted by abilities like Blast Padding, and won't attract Lost very quickly, but won't deal any damage at all to enemies immune to acid like Andromedons or Bio Division units. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="acid launcher"

[ABBA_ADVENT_GRENADELAUNCHER_MG X2WeaponTemplate]
FriendlyName="Enhanced Advent Acid Launcher"
FriendlyNamePlural="Enhanced Advent Acid Launchers"
BriefSummary="A madman's creation; the Advent Acid Launcher fires the same sorts of acid blobs that the Andromedon does. Unlike with an Andromedon's acid weapon system, this launcher cannot produce acid indefinitely and is limited to 3 charges per mission. Although it resembles a standard grenade launcher on the outside, its internals were designed for its own acid blob rounds only and cannot fire grenades. The launcher must cool down between shots."
TacticalText="<Bullet/> Has improved range, radius, damage, shred and an extra charge compared to the standard variant. \n<Bullet/> Cannot launch grenades, and thus provides no range or radius bonus to them. \n<Bullet/> The Advent Acid Launcher deals pure acid damage, and as such will not destroy loot, is not resisted by abilities like Blast Padding, and won't attract Lost very quickly, but won't deal any damage at all to enemies immune to acid like Andromedons or Bio Division units. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="acid launcher"

[ABBA_ADVENT_GRENADELAUNCHER_BM X2WeaponTemplate]
FriendlyName="Master-crafted Advent Acid Launcher"
FriendlyNamePlural="Master-crafted Advent Acid Launchers"
BriefSummary="A madman's creation; the Advent Acid Launcher fires the same sorts of acid blobs that the Andromedon does. Unlike with an Andromedon's acid weapon system, this launcher cannot produce acid indefinitely and is limited to 4 charges per mission. Although it resembles a standard grenade launcher on the outside, its internals were designed for its own acid blob rounds only and cannot fire grenades. The launcher must cool down between shots."
TacticalText="<Bullet/> Has improved range, radius, damage, shred and an extra charge compared to the Enhanced variant. \n<Bullet/> Cannot launch grenades, and thus provides no range or radius bonus to them. \n<Bullet/> The Advent Acid Launcher deals pure acid damage, and as such will not destroy loot, is not resisted by abilities like Blast Padding, and won't attract Lost very quickly, but won't deal any damage at all to enemies immune to acid like Andromedons or Bio Division units. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="acid launcher"

[ABBA_ADVENT_PISTOL_CV X2WeaponTemplate]
FriendlyName="Advent Persuader Pistol"
FriendlyNamePlural="Advent Persuader Pistols"
BriefSummary="Named after its widespread use among Advent officers for torturing information out of captured enemy non-combatants, the Advent Persuader pistol makes up for its low stopping power with excellent handling. It can be fired in close range without spending an action once a turn and cannot graze."
TacticalText="<Bullet/> Uses the same range table as Autopistols and Shotguns do. \n<Bullet/> The Persuader is an excellent choice for softening up a target before following up with a primary weapon attack. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="pistol"

[ABBA_ADVENT_PISTOL_MG X2WeaponTemplate]
FriendlyName="Enhanced Advent Persuader Pistol"
FriendlyNamePlural="Enhanced Advent Persuader Pistols"
BriefSummary="Named after its widespread use among Advent officers for torturing information out of captured enemy non-combatants, the Advent Persuader pistol makes up for its low stopping power with excellent handling. It can be fired in close range without spending an action once a turn and cannot graze."
TacticalText="<Bullet/> Uses the same range table as Autopistols and Shotguns do. \n<Bullet/> The Persuader is an excellent choice for softening up a target before following up with a primary weapon attack. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="pistol"

[ABBA_ADVENT_PISTOL_BM X2WeaponTemplate]
FriendlyName="Master-crafted Advent Persuader Pistol"
FriendlyNamePlural="Master-crafted Advent Persuader Pistols"
BriefSummary="Named after its widespread use among Advent officers for torturing information out of captured enemy non-combatants, the Advent Persuader pistol makes up for its low stopping power with excellent handling. It can be fired in close range without spending an action once a turn and cannot graze."
TacticalText="<Bullet/> Uses the same range table as Autopistols and Shotguns do. \n<Bullet/> The Persuader is an excellent choice for softening up a target before following up with a primary weapon attack. \n<Bullet/> This appears to be some kind of test model. It lacks the usual security features found on the typical Advent weaponry, but isn't something we have the means to reverse engineer. We'll have to make do with what we find in the field."
AbilityDescName="pistol"

[ABBA_LMG_CV X2WeaponTemplate]
FriendlyName="Light Machine Gun"
FriendlyNamePlural="Light Machine Guns"
BriefSummary="The Light Machine Gun specializes in handling crowds of enemies due to its massive magazine and the Spray ability. Standard shots, Overwatch, and reloading take 2 actions each. Damage is slightly lower than a Cannon, but the Light Machine Gun also has a small amount of innate armor shredding."
TacticalText="<Bullet/> Standard shots and standard Overwatch both require 2 actions. \n<Bullet/> Shares the same range table as the Cannon. \n<Bullet/> Consider the Light Machine Gun over the Cannon if the soldier specializes in suppressing targets, or makes use of multi-target abilities limited only by ammo such as Kill Zone."
AbilityDescName="LMG"

[ABBA_LMG_LASER X2WeaponTemplate]
FriendlyName="Enhanced Laser LMG"
FriendlyNamePlural="Enhanced Laser LMGs"
BriefSummary="Enhanced Lasers are a step up from standard laser weaponry, and offer their own advantages and disadvantages compared to our standard magnetic weapons. The Enhanced Laser LMG handles very similarly to the Light Machine Gun in terms of its massive magazine and Spray ability, as well as needing 2 actions for shooting, Overwatch and reloading."
TacticalText="<Bullet/> The Enhanced Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Prototype Plasma weaponry. \n<Bullet/> Consider a LMG variant over a Cannon variant if the soldier specializes in suppressing targets, or makes use of multi-target abilities limited only by ammo such as Kill Zone."
AbilityDescName="LMG"

[ABBA_LMG_LASERM2 X2WeaponTemplate]
FriendlyName="Master-crafted Laser LMG"
FriendlyNamePlural="Master-crafted Laser LMGs"
BriefSummary="Master-crafted Lasers double down on the traits of Enhanced Lasers, and offer their own advantages and disadvantages compared to our standard beam weapons. The Master-crafted Laser LMG handles very similarly to the Light Machine Gun in terms of its massive magazine and Spray ability, as well as needing 2 actions for shooting, Overwatch and reloading."
TacticalText="<Bullet/> The Master-crafted Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Turbulent Plasma weaponry. \n<Bullet/> Consider a LMG variant over a Cannon variant if the soldier specializes in suppressing targets, or makes use of multi-target abilities limited only by ammo such as Kill Zone."
AbilityDescName="LMG"

[ABBA_LMG_PLASMA X2WeaponTemplate]
FriendlyName="Prototype Plasma LMG"
FriendlyNamePlural="Prototype Plasma LMGs"
BriefSummary="Prototype Plasma weapons are a cutting-edge alternative to our standard magnetic weapons, and offer their own advantages and disadvantages compared to them. The Prototype Plasma LMG handles very similarly to the Light Machine Gun in terms of its massive magazine and Spray ability, as well as needing 2 actions for shooting, Overwatch and reloading."
TacticalText="<Bullet/> The Prototype Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Enhanced Laser series of weapons. \n<Bullet/> Consider a LMG variant over a Cannon variant if the soldier specializes in suppressing targets, or makes use of multi-target abilities limited only by ammo such as Kill Zone."
AbilityDescName="LMG"

[ABBA_LMG_PLASMAM2 X2WeaponTemplate]
FriendlyName="Turbulent Plasma LMG"
FriendlyNamePlural="Turbulent Plasma LMGs"
BriefSummary="Turbulent Plasma weapons double down on the traits of Prototype Plasma, and are a cutting-edge alternative to our standard beam weapons. The Turbulent Plasma LMG handles very similarly to the Light Machine Gun in terms of its massive magazine and Spray ability, as well as needing 2 actions for shooting, Overwatch and reloading."
TacticalText="<Bullet/> The Turbulent Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Master-Crafted Laser series of weapons. \n<Bullet/> Consider a LMG variant over a Cannon variant if the soldier specializes in suppressing targets, or makes use of multi-target abilities limited only by ammo such as Kill Zone."
AbilityDescName="LMG"

[ABBA_SHOTGUN_CV X2WeaponTemplate]
FriendlyName="Hunting Shotgun"
FriendlyNamePlural="Hunting Shotguns"
BriefSummary="The Hunting Shotgun hits harder than our standard shotgun model and pierces a bit of armor, but is slower to reload and doesn't critically hit as often."
TacticalText="<Bullet/> This shotgun has two options for reloading: Single Reload, which loads one round for one action and does not end the turn, and Full Reload, which loads an entire magazine for two actions. \n<Bullet/> An excellent choice for quick smash and grab missions and taking out robots, but it falls short when dealing with swarms of weaker enemies like the Lost."
AbilityDescName="shotgun"

[ABBA_SHOTGUN_LASER X2WeaponTemplate]
FriendlyName="Enhanced Scatterray"
FriendlyNamePlural="Enhanced Scatterrays"
BriefSummary="Enhanced Lasers are a step up from standard laser weaponry, and offer their own advantages and disadvantages compared to our standard magnetic weapons. The Enhanced Scatterray handles very similarly to the Hunting Shotgun in terms of its solid damage and extra pierce, as well as its reloading mechanics."
TacticalText="<Bullet/> The Enhanced Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Prototype Plasma weaponry. \n<Bullet/> This shotgun has two options for reloading: Single Reload, which loads one round for one action and does not end the turn, and Full Reload, which loads an entire magazine for two actions. \n<Bullet/> An excellent choice for quick smash and grab missions and taking out robots, but it falls short when dealing with swarms of weaker enemies like the Lost."
AbilityDescName="shotgun"

[ABBA_SHOTGUN_LASERM2 X2WeaponTemplate]
FriendlyName="Master-Crafted Scatterray"
FriendlyNamePlural="Master-Crafted Scatterrays"
BriefSummary="Master-Crafted Lasers double down on the traits of Enhanced Lasers, and offer their own advantages and disadvantages compared to our standard beam weapons. The Master-Crafted Scatterray handles very similarly to the Hunting Shotgun in terms of its solid damage and extra pierce, as well as its reloading mechanics."
TacticalText="<Bullet/> The Master-Crafted Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Turbulent Plasma weaponry. \n<Bullet/> This shotgun has two options for reloading: Single Reload, which loads one round for one action and does not end the turn, and Full Reload, which loads an entire magazine for two actions. \n<Bullet/> An excellent choice for quick smash and grab missions and taking out robots, but it falls short when dealing with swarms of weaker enemies like the Lost."
AbilityDescName="shotgun"

[ABBA_SHOTGUN_PLASMA X2WeaponTemplate]
FriendlyName="Prototype Plasma Trench Gun"
FriendlyNamePlural="Prototype Plasma Trench Guns"
BriefSummary="Prototype Plasma weapons are a cutting-edge alternative to our standard magnetic weapons, and offer their own advantages and disadvantages compared to them. The Prototype Plasma Trench Gun handles very similarly to the Hunting Shotgun in terms of its solid damage and extra pierce, as well as its reloading mechanics."
TacticalText="<Bullet/> The Prototype Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Enhanced Laser series of weapons. \n<Bullet/> This shotgun has two options for reloading: Single Reload, which loads one round for one action and does not end the turn, and Full Reload, which loads an entire magazine for two actions. \n<Bullet/> An excellent choice for quick smash and grab missions and taking out robots, but it falls short when dealing with swarms of weaker enemies like the Lost."
AbilityDescName="shotgun"

[ABBA_SHOTGUN_PLASMAM2 X2WeaponTemplate]
FriendlyName="Turbulent Plasma Street Sweeper"
FriendlyNamePlural="Turbulent Plasma Street Sweepers"
BriefSummary="Turbulent Plasma weapons double down on the traits of Prototype Plasma, and are a cutting-edge alternative to our standard beam weapons. The Turbulent Plasma Street Sweeper handles very similarly to the Hunting Shotgun in terms of its solid damage and extra pierce, as well as its reloading mechanics."
TacticalText="<Bullet/> The Turbulent Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Master-Crafted Laser series of weapons. \n<Bullet/> This shotgun has two options for reloading: Single Reload, which loads one round for one action and does not end the turn, and Full Reload, which loads an entire magazine for two actions. \n<Bullet/> An excellent choice for quick smash and grab missions and taking out robots, but it falls short when dealing with swarms of weaker enemies like the Lost."
AbilityDescName="shotgun"

[ABBA_SNIPERRIFLE_CV X2WeaponTemplate]
FriendlyName="Auto-Sniper Rifle"
FriendlyNamePlural="Auto-Sniper Rifles"
BriefSummary="The Auto-Sniper Rifle is one of the most deadly conventional weapons available to us, and one of the hardest to use. Its burst damage is overwhelming, but the massive recoil makes it harder to land shots reliably than a regular sniper rifle. It requires 2 actions to fire, and its magazine must be reloaded after every burst."
TacticalText="<Bullet/> Cannot equip Auto Loaders or Extended Magazines.\n<Bullet/> Requires 2 actions to fire or Overwatch."
AbilityDescName="auto-sniper rifle"

[ABBA_SNIPERRIFLE_LASER X2WeaponTemplate]
FriendlyName="Enhanced Laser Auto-Lance"
FriendlyNamePlural="Enhanced Laser Auto-Lances"
BriefSummary="Enhanced Lasers are a step up from standard laser weaponry, and offer their own advantages and disadvantages compared to our standard magnetic weapons. The Enhanced Laser Auto-Lance handles very similarly to the Auto-Sniper Rifle in terms of its massive burst damage, lower accuracy and single-burst magazine."
TacticalText="<Bullet/> The Enhanced Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Prototype Plasma weaponry. \n<Bullet/> Cannot equip Auto Loaders or Extended Magazines.\n<Bullet/> Requires 2 actions to fire or Overwatch."
AbilityDescName="auto-sniper rifle"

[ABBA_SNIPERRIFLE_LASERM2 X2WeaponTemplate]
FriendlyName="Master-Crafted Laser Auto-Lance"
FriendlyNamePlural="Master-Crafted Laser Auto-Lances"
BriefSummary="Master-Crafted Lasers double down on the traits of Enhanced Lasers, and offer their own advantages and disadvantages compared to our standard beam weapons. The Master-Crafted Laser Auto-Lance handles very similarly to the Auto-Sniper Rifle in terms of its massive burst damage, lower accuracy and single-burst magazine."
TacticalText="<Bullet/> The Master-Crafted Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Turbulent Plasma weaponry. \n<Bullet/> Cannot equip Auto Loaders or Extended Magazines.\n<Bullet/> Requires 2 actions to fire or Overwatch."
AbilityDescName="auto-sniper rifle"

[ABBA_SNIPERRIFLE_PLASMA X2WeaponTemplate]
FriendlyName="Prototype Plasma Auto-Long Rifle"
FriendlyNamePlural="Prototype Plasma Auto-Long Rifles"
BriefSummary="Prototype Plasma weapons are a cutting-edge alternative to our standard magnetic weapons, and offer their own advantages and disadvantages compared to them. The Prototype Plasma Auto-Long Rifle handles very similarly to the Auto-Sniper Rifle in terms of its massive burst damage, lower accuracy and single-burst magazine."
TacticalText="<Bullet/> The Prototype Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Enhanced Laser series of weapons. \n<Bullet/> Cannot equip Auto Loaders or Extended Magazines.\n<Bullet/> Requires 2 actions to fire or Overwatch."
AbilityDescName="auto-sniper rifle"

[ABBA_SNIPERRIFLE_PLASMAM2 X2WeaponTemplate]
FriendlyName="Turbulent Plasma Auto-Long Rifle"
FriendlyNamePlural="Turbulent Plasma Auto-Long Rifles"
BriefSummary="Turbulent Plasma weapons double down on the traits of Prototype Plasma, and are a cutting-edge alternative to our standard beam weapons. The Turbulent Plasma Auto-Long Rifle handles very similarly to the Auto-Sniper Rifle in terms of its massive burst damage, lower accuracy and single-burst magazine."
TacticalText="<Bullet/> The Turbulent Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Master-Crafted Laser series of weapons. \n<Bullet/> Cannot equip Auto Loaders or Extended Magazines.\n<Bullet/> Requires 2 actions to fire or Overwatch."
AbilityDescName="auto-sniper rifle"

[ABBA_ASSAULTRIFLE_CV X2WeaponTemplate]
FriendlyName="Marauder Auto-Rifle"
FriendlyNamePlural="Marauder Auto-Rifles"
BriefSummary="The Marauder Auto-Rifle is an assault rifle style weapon with a high rate of fire. It has a slightly bigger magazine than a standard assault rifle and better close range accuracy, but its accuracy is poor at long range, and its damage potential per shot is slightly lower. Includes the Pierce The Veil ability, which can be activated to make this weapon have greater Aim, damage, and piercing against organic targets while putting other cooldown-based abilities on a 2 turn cooldown."
TacticalText="<Bullet/> Shares the same range table as an SMG.\n<Bullet/> Unlike an LMG, an Auto-Rifle's Standard Shot takes only a single action, allowing you to follow up a Spray attack with a Standard Shot, or move and then fire a Standard Shot."
AbilityDescName="auto-rifle"

[ABBA_ASSAULTRIFLE_LASER X2WeaponTemplate]
FriendlyName="Enhanced Laser Auto-Rifle"
FriendlyNamePlural="Enhanced Laser Auto-Rifles"
BriefSummary="Enhanced Lasers are a step up from standard laser weaponry, and offer their own advantages and disadvantages compared to our standard magnetic weapons. The Enhanced Laser Auto-Rifle handles similarly to the Marauder Auto-Rifle, dominating up close with its high rate of fire, while not being as accurate at longer ranges. Includes the Pierce The Veil ability, which can be activated to make this weapon have greater Aim, damage, and piercing against organic targets while putting other cooldown-based abilities on a 2 turn cooldown."
TacticalText="<Bullet/> The Enhanced Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Prototype Plasma weaponry.\n<Bullet/> Unlike an LMG, an Auto-Rifle's Standard Shot takes only a single action, allowing you to follow up a Spray attack with a Standard Shot, or move and then fire a Standard Shot."
AbilityDescName="auto-rifle"

[ABBA_ASSAULTRIFLE_LASERM2 X2WeaponTemplate]
FriendlyName="Master-crafted Laser Auto-Rifle"
FriendlyNamePlural="Master-crafted Laser Auto-Rifles"
BriefSummary="Master-Crafted Lasers double down on the traits of Enhanced Lasers, and offer their own advantages and disadvantages compared to our standard beam weapons. The Master-Crafted Laser Auto-Rifle handles similarly to the Marauder Auto-Rifle, dominating up close with its high rate of fire, while not being as accurate at longer ranges. Includes the Pierce The Veil ability, which can be activated to make this weapon have greater Aim, damage, and piercing against organic targets while putting other cooldown-based abilities on a 2 turn cooldown."
TacticalText="<Bullet/> The Master-Crafted Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Turbulent Plasma weaponry.\n<Bullet/> Unlike an LMG, an Auto-Rifle's Standard Shot takes only a single action, allowing you to follow up a Spray attack with a Standard Shot, or move and then fire a Standard Shot."
AbilityDescName="auto-rifle"

[ABBA_ASSAULTRIFLE_PLASMA X2WeaponTemplate]
FriendlyName="Prototype Plasma Auto-Rifle"
FriendlyNamePlural="Prototype Plasma Auto-Rifles"
BriefSummary="Prototype Plasma weapons are a cutting-edge alternative to our standard magnetic weapons, and offer their own advantages and disadvantages compared to them. The Prototype Plasma Auto-Rifle handles similarly to the Marauder Auto-Rifle, dominating up close with its high rate of fire, while not being as accurate at longer ranges. Includes the Pierce The Veil ability, which can be activated to make this weapon have greater Aim, damage, and piercing against organic targets while putting other cooldown-based abilities on a 2 turn cooldown."
TacticalText="<Bullet/> The Prototype Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Enhanced Laser series of weapons.\n<Bullet/> Unlike an LMG, an Auto-Rifle's Standard Shot takes only a single action, allowing you to follow up a Spray attack with a Standard Shot, or move and then fire a Standard Shot."
AbilityDescName="auto-rifle"

[ABBA_ASSAULTRIFLE_PLASMAM2 X2WeaponTemplate]
FriendlyName="Turbulent Plasma Auto-Rifle"
FriendlyNamePlural="Turbulent Plasma Auto-Rifles"
BriefSummary="Turbulent Plasma weapons double down on the traits of Prototype Plasma, and are a cutting-edge alternative to our standard beam weapons. The Turbulent Plasma Auto-Rifle handles similarly to the Marauder Auto-Rifle, dominating up close with its high rate of fire, while not being as accurate at longer ranges. Includes the Pierce The Veil ability, which can be activated to make this weapon have greater Aim, damage, and piercing against organic targets while putting other cooldown-based abilities on a 2 turn cooldown."
TacticalText="<Bullet/> The Turbulent Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Master-Crafted Laser series of weapons.\n<Bullet/> Unlike an LMG, an Auto-Rifle's Standard Shot takes only a single action, allowing you to follow up a Spray attack with a Standard Shot, or move and then fire a Standard Shot."
AbilityDescName="auto-rifle"

[ABBA_PISTOL_CV X2WeaponTemplate]
FriendlyName="Semi-Auto Pistol"
FriendlyNamePlural="Semi-Auto Pistols"
BriefSummary="The Semi-Auto Pistol has lower damage than our revolver-type Pistols, but compensates for it with its ease of handling and higher rate of fire. It can be fired accurately enough to never graze."
TacticalText="<Bullet/> This weapon can be fired accurately enough to never graze.\n<Bullet/> Consider a Semi-Auto Pistol over a standard Pistol on soldiers that carry special ammo or have abilities like Center Mass that add flat damage."
AbilityDescName="pistol"

[ABBA_PISTOL_LASER X2WeaponTemplate]
FriendlyName="Enhanced Laser Semi-Auto Pistol"
FriendlyNamePlural="Enhanced Laser Semi-Auto Pistols"
BriefSummary="Enhanced Lasers are a step up from standard laser weaponry, and offer their own advantages and disadvantages compared to our standard magnetic weapons. The Enhanced Laser Semi-Auto Pistol handles similarly to the Semi-Auto Pistol in terms of its lower stopping power and high rate of fire. It can be fired accurately enough to never graze."
TacticalText="<Bullet/> The Enhanced Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Prototype Plasma weaponry.\n<Bullet/> It can be fired accurately enough to never graze."
AbilityDescName="pistol"

[ABBA_PISTOL_LASERM2 X2WeaponTemplate]
FriendlyName="Master-Crafted Laser Semi-Auto Pistol"
FriendlyNamePlural="Master-Crafted Laser Semi-Auto Pistols"
BriefSummary="Master-Crafted Laser weapons double down on the traits of Enhanced Lasers, and offer their own advantages and disadvantages compared to our standard beam weapons. The Master-Crafted Laser Semi-Auto Pistol handles similarly to the Semi-Auto Pistol in terms of its lower stopping power and high rate of fire. It can be fired accurately enough to never graze."
TacticalText="<Bullet/> The Master-Crafted Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Turbulent Plasma weaponry.\n<Bullet/> It can be fired accurately enough to never graze."
AbilityDescName="pistol"

[ABBA_PISTOL_PLASMA X2WeaponTemplate]
FriendlyName="Prototype Plasma Semi-Auto Pistol"
FriendlyNamePlural="Prototype Plasma Semi-Auto Pistols"
BriefSummary="Prototype Plasma weapons are a cutting-edge alternative to our standard magnetic weapons, and offer their own advantages and disadvantages compared to them. The Prototype Plasma Semi-Auto Pistol handles similarly to the Semi-Auto Pistol in terms of its lower stopping power and high rate of fire. It can be fired accurately enough to never graze."
TacticalText="<Bullet/> The Prototype Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Enhanced Laser series of weapons.\n<Bullet/> It can be fired accurately enough to never graze."
AbilityDescName="pistol"

[ABBA_PISTOL_PLASMAM2 X2WeaponTemplate]
FriendlyName="Turbulent Plasma Semi-Auto Pistol"
FriendlyNamePlural="Turbulent Plasma Semi-Auto Pistols"
BriefSummary="Turbulent Plasma weapons double down on the traits of Prototype Plasma, and are a cutting-edge alternative to our standard beam weapons. The Turbulent Plasma Semi-Auto Pistol handles similarly to the Semi-Auto Pistol in terms of its lower stopping power and ease of handling. It can be fired accurately enough to never graze."
TacticalText="<Bullet/> The Turbulent Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Master-Crafted Laser series of weapons.\n<Bullet/> It can be fired accurately enough to never graze."
AbilityDescName="pistol"

[ABBA_SMG_PLASMAM2 X2WeaponTemplate]
FriendlyName="Turbulent Plasma SMG"
FriendlyNamePlural="Turbulent Plasma SMGs"
BriefSummary="Turbulent Plasma weapons double down on the traits of Prototype Plasma, and are a cutting-edge alternative to our standard beam weapons. The Turbulent Plasma SMG handles similarly to our standard SMGs, including granting bonus mobility and stealth."
TacticalText="<Bullet/> The Turbulent Plasma series of weapons specializes in critical hits, damage potential, terrain destruction and armor shredding. They typically do not pierce armor as well, are inaccurate, loud, and have wildly inconsistent damage unlike the Master-Crafted Laser series of weapons."
AbilityDescName="smg"

[ABBA_SMG_LASERM2 X2WeaponTemplate]
FriendlyName="Master-Crafted Laser SMG"
FriendlyNamePlural="Master-Crafted Laser SMGs"
BriefSummary="Master-Crafted Laser weapons double down on the traits of Enhanced Lasers, and offer their own advantages and disadvantages compared to our standard beam weapons. The Master-Crafted Laser SMG handles similarly to our standard SMGs, including granting bonus mobility and stealth."
TacticalText="<Bullet/> The Master-Crafted Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Turbulent Plasma weaponry."
AbilityDescName="smg"

[ABBA_SPARKRIFLE_LASERM2 X2WeaponTemplate]
FriendlyName="Master-Crafted Heavy Railgun"
FriendlyNamePlural="Master-Crafted Heavy Railguns"
BriefSummary="Master-Crafted Laser weapons double down on the traits of Enhanced Lasers, and offer their own advantages and disadvantages compared to our standard beam weapons. The Master-Crafted Heavy Railgun handles similarly to our SPARK units' standard autocannons and offers comparible output to the Elerium Phase-Cannon."
TacticalText="<Bullet/> The Master-Crafted Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Turbulent Plasma weaponry."
AbilityDescName="autocannon"

[ABBA_BULLPUP_LASERM2 X2WeaponTemplate]
FriendlyName="Kal-LX Bullpup"
FriendlyNamePlural="Kal-LX Bullpups"
BriefSummary="Master-Crafted Laser weapons double down on the traits of Enhanced Lasers, and offer their own advantages and disadvantages compared to our standard beam weapons. The Kal-LX Bullpup handles similarly to the Skirmishers' other bullpups, and is comparible in output to the Kal-90 Bullpup."
TacticalText="<Bullet/> The Master-Crafted Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Turbulent Plasma weaponry."
AbilityDescName="bullpup"

[ABBA_VEKTORRIFLE_LASERM2 X2WeaponTemplate]
FriendlyName="Eclipse Lance"
FriendlyNamePlural="Eclipse Lances"
BriefSummary="Master-Crafted Laser weapons double down on the traits of Enhanced Lasers, and offer their own advantages and disadvantages compared to our standard beam weapons. The Eclipse Lance handles similarly to the Reapers' other Vektor Rifles, and is comparible in output to the Shadow Lance."
TacticalText="<Bullet/> The Master-Crafted Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Turbulent Plasma weaponry."
AbilityDescName="vektor rifle"

[ABBA_AUTOPISTOL_LASERM2 X2WeaponTemplate]
FriendlyName="Master-Crafted Laser Autopistol"
FriendlyNamePlural="Master-Crafted Laser Autopistols"
BriefSummary="Master-Crafted Laser weapons double down on the traits of Enhanced Lasers, and offer their own advantages and disadvantages compared to our standard beam weapons. The Master-Crafted Laser Autopistol handles similarly to the Templars' other autopistols, and is comparible in output to the Beam Autopistol."
TacticalText="<Bullet/> The Master-Crafted Laser series of weapons specializes in accuracy, consistent damage, noise reduction and armor piercing. Critical hits, armor shredding, terrain destruction and overall damage potential are lower compared to Turbulent Plasma weaponry."
AbilityDescName="autopistol"

[ABBA_WRISTBLADE_LASERM2 X2PairedWeaponTemplate]
FriendlyName="Master-Crafted Laser-Edged Ripjack"
FriendlyNamePlural="Master-Crafted Laser-Edged Ripjacks"
BriefSummary="The Master-Crafted Laser-Edged Ripjack handles similarly to the Skirmishers' standard Ripjacks and offers comparible effectiveness to the Fusion Ripjack. However, while lacking the Fusion Ripjack's burn chance, the Master-Crafted Laser-Edged Ripjack's light weight and precision cuts grant it the Body Harvest ability, allowing the user to make a perfectly accurate melee attack against a damaged target on 3 or less HP as a free action with a 5-turn cooldown."
TacticalText="<Bullet/> Master-Crafted Laser-Edged melee weapons specialize in accuracy and consistent damage. Critical hits and overall damage potential are lower compared to Fusion melee weapons."
AbilityDescName="ripjack"

[ABBA_SWORD_CONVENTIONAL X2WeaponTemplate]
FriendlyName="Alloy Sword"
FriendlyNamePlural="Alloy Swords"
BriefSummary="A marginal improvement to the standard sword in terms of damage; the Alloy Sword incorporates Alien Alloys for a deadlier blade. It does not have any additional status effects or abilities."
TacticalText="<Bullet/> The Alloy Sword needs no corpses to construct, allowing our melee soldiers to keep up for a while longer if we aren't finding opportunities for full salvage missions."
AbilityDescName="sword"

[ABBA_SWORD_LASER X2WeaponTemplate]
FriendlyName="Laser-Edged Sword"
FriendlyNamePlural="Laser-Edged Swords"
BriefSummary="The Laser-Edged Sword handles similarly to our soldiers' standard Swords and offers comparible effectiveness to the Arc Blade. However, while lacking the Arc Blade's stun chance, the Laser-Edged Sword's light weight and precision cuts grant it the Body Harvest ability, allowing the user to make a perfectly accurate melee attack against a damaged target on 3 or less HP as a free action with a 5-turn cooldown."
TacticalText="<Bullet/> Laser-Edged melee weapons specialize in accuracy and consistent damage. Critical hits and overall damage potential are lower compared to Arc melee weapons."
AbilityDescName="sword"

[ABBA_SWORD_PLASMA X2WeaponTemplate]
FriendlyName="Plasma-Edged Sword"
FriendlyNamePlural="Plasma-Edged Swords"
BriefSummary="The Plasma-Edged Sword handles similarly to our soldiers' standard Swords and slightly surpasses Arc melee weapons. While lacking the Arc Blade's stun chance, the Plasma-Edged Sword's vicious blade grants it the Mutilate ability, a ruthless slash attack on a 5-turn cooldown that is guaranteed to be a critical hit on most targets and deals 1 point of Rupture to the target."
TacticalText="<Bullet/> Plasma-Edged melee weapons specialize in critical hits and damage potential. Accuracy and damage consistency are lower compared to Arc melee weapons."
AbilityDescName="sword"

[ABBA_SWORD_LASERM2 X2WeaponTemplate]
FriendlyName="Master-Crafted Laser-Edged Sword"
FriendlyNamePlural="Master-Crafted Laser-Edged Swords"
BriefSummary="The Master-Crafted Laser-Edged Sword handles similarly to our soldiers' standard Swords and offers comparible effectiveness to the Fusion Blade. However, while lacking the Fusion Blade's burn chance, the Master-Crafted Laser-Edged Sword's light weight and precision cuts grant it the Body Harvest ability, allowing the user to make a perfectly accurate melee attack against a damaged target on 3 or less HP as a free action with a 5-turn cooldown."
TacticalText="<Bullet/> Master-Crafted Laser-Edged melee weapons specialize in accuracy and consistent damage. Critical hits and overall damage potential are lower compared to Fusion melee weapons."
AbilityDescName="sword"